#  Very Simple Intent Matching Example for Uyghur
INTENTS = {
    "greeting":  ["ياخشىمۇسىز", "سالام", "ئەسسالامۇ ئەلەيكۇم"],
    "farewell": ["خوش", "خۇداغا ئامانەت", "خۇشچە قال","ئاللاھقا ئامانەت","خەير—خوش"],
    "thanks":   ["ھەشقاللا رەھمەت", "بەك رەھمەت", "سىزگە كۆپ رەھمەت"],
    "apology":  ["كەچۈرۈڭ", "ئەپۇ قىلىڭ", "ئاۋارە قىلدىم. سەت بولدى"],
    "ask_name": ["ئىسمىڭىز نېمە؟","سىز كىم","سىزنىڭ ئىسمىڭىز نېمە؟", "ئىسىمىڭىزنى بىلسەم بۇلامدۇ؟"],
    "ask_help": ["ياردەم قىلالاسىزمۇ؟", "ماڭا ياردەم قىلىڭ", "ياردەمگە مۇھتاجىمەن"],
}